Revit 2024 API
NumberSystem.ReferenceOffset Property
 The offset to the reference curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double ReferenceOffset { get; set; }
Visual Basic
Public Property ReferenceOffset As Double
	Get
	Set
Visual C++
public:
property double ReferenceOffset {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for referenceOffset must be no more than 30000 feet in absolute value.
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace